--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ckendri2\Downloads\data analysis.log
  log type:  text
 opened on:  19 Apr 2024, 18:16:56

. import excel "C:\Users\ckendri2\Downloads\Data 4.xlsx", sheet("Sheet1") firstrow
(6 vars, 56 obs)

. sum Consump1000 CPI UnemploymentRate Production

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 Consump1000 |         56    79.24877    109.2283     23.345    364.717
         CPI |         56    123.4415     24.0962   104.7636     194.94
Unemployme~e |         56    7.583144    3.634279   2.566667       14.7
  Production |         56    97.42496    11.61529   68.63402   119.3004

. gen after = 1 if Quarter >= 6
(35 missing values generated)

. recode after . = 0
(35 changes made to after)

. gen treatment = 1 if CountryID == 1
(48 missing values generated)

. recode treatment . = 0
(48 changes made to treatment)

. gen inact treatment * after
variable treatment already defined
r(110);

. gen inact = treatment * after

. reg Consump1000 treatment after inact CPI UnemploymentRate Production

      Source |       SS           df       MS      Number of obs   =        56
-------------+----------------------------------   F(6, 49)        =   1425.45
       Model |  652457.594         6  108742.932   Prob > F        =    0.0000
    Residual |  3738.04734        49  76.2866804   R-squared       =    0.9943
-------------+----------------------------------   Adj R-squared   =    0.9936
       Total |  656195.642        55  11930.8299   Root MSE        =    8.7342

----------------------------------------------------------------------------------
     Consump1000 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
       treatment |   294.0561   4.363767    67.39   0.000     285.2868    302.8255
           after |  -.6040744   2.706857    -0.22   0.824    -6.043708    4.835559
           inact |   24.76532   6.978051     3.55   0.001      10.7424    38.78824
             CPI |   .0589268    .070277     0.84   0.406    -.0823001    .2001536
UnemploymentRate |  -1.513293   .4579925    -3.30   0.002    -2.433663   -.5929225
      Production |   .3007152   .1173275     2.56   0.013     .0649367    .5364937
           _cons |   11.04491   14.91913     0.74   0.463     -18.9362    41.02602
----------------------------------------------------------------------------------

. reg Consump1000 treatment after inact CPI UnemploymentRate Production, robust

Linear regression                               Number of obs     =         56
                                                F(6, 49)          =   21536.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9943
                                                Root MSE          =     8.7342

----------------------------------------------------------------------------------
                 |               Robust
     Consump1000 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
       treatment |   294.0561   5.121128    57.42   0.000     283.7648    304.3474
           after |  -.6040744   2.854615    -0.21   0.833    -6.340638    5.132489
           inact |   24.76532      5.142     4.82   0.000     14.43208    35.09855
             CPI |   .0589268   .0533646     1.10   0.275    -.0483134    .1661669
UnemploymentRate |  -1.513293   .5173899    -2.92   0.005    -2.553027   -.4735589
      Production |   .3007152   .1231899     2.44   0.018     .0531558    .5482746
           _cons |   11.04491   15.47448     0.71   0.479    -20.05223    42.14204
----------------------------------------------------------------------------------

. reg Consump1000 treatment after inact CPI UnemploymentRate, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =   19909.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9935
                                                Root MSE          =     9.2078

----------------------------------------------------------------------------------
                 |               Robust
     Consump1000 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
       treatment |   296.8736   5.247973    56.57   0.000     286.3327    307.4145
           after |   .8194308   2.868789     0.29   0.776    -4.942702    6.581563
           inact |   24.74565   5.496757     4.50   0.000     13.70509    35.78621
             CPI |   .0157532   .0511572     0.31   0.759    -.0869991    .1185056
UnemploymentRate |  -1.596629   .5805807    -2.75   0.008    -2.762759   -.4304981
           _cons |   45.36817    4.16513    10.89   0.000     37.00226    53.73408
----------------------------------------------------------------------------------

. reg Consump1000 treatment after inact CPI, robust

Linear regression                               Number of obs     =         56
                                                F(4, 51)          =    9104.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9921
                                                Root MSE          =     10.069

------------------------------------------------------------------------------
             |               Robust
 Consump1000 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   treatment |   296.4825   7.084031    41.85   0.000     282.2607    310.7043
       after |   2.333674   2.927594     0.80   0.429    -3.543717    8.211065
       inact |   28.60254   7.616226     3.76   0.000     13.31233    43.89275
         CPI |  -.1496673   .0273441    -5.47   0.000     -.204563   -.0947716
       _cons |   52.96187   4.583137    11.56   0.000     43.76084     62.1629
------------------------------------------------------------------------------

. reg Consump1000 treatment after inact, robust

Linear regression                               Number of obs     =         56
                                                F(3, 52)          =    8269.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9910
                                                Root MSE          =     10.633

------------------------------------------------------------------------------
             |               Robust
 Consump1000 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   treatment |   296.9274   6.987891    42.49   0.000     282.9052    310.9496
       after |   1.653644   3.126251     0.53   0.599    -4.619638    7.926927
       inact |   28.32949    7.56445     3.75   0.000     13.15031    43.50867
       _cons |    34.6928   1.868887    18.56   0.000      30.9426      38.443
------------------------------------------------------------------------------

. reg Consump1000 treatment after inact UnemploymentRate Production, robust

Linear regression                               Number of obs     =         56
                                                F(5, 50)          =   16972.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9942
                                                Root MSE          =     8.7083

----------------------------------------------------------------------------------
                 |               Robust
     Consump1000 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
       treatment |   294.1282   5.337132    55.11   0.000     283.4083    304.8482
           after |   -.116866    2.69477    -0.04   0.966     -5.52947    5.295738
           inact |   25.43954   5.508338     4.62   0.000     14.37572    36.50336
UnemploymentRate |  -1.261843   .3892558    -3.24   0.002    -2.043686   -.4799995
      Production |   .2771349   .1114891     2.49   0.016     .0532024    .5010675
           _cons |   18.48031   12.44435     1.49   0.144    -6.514906    43.47554
----------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  C:\Users\ckendri2\Downloads\data analysis.log
  log type:  text
 closed on:  19 Apr 2024, 18:24:48
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
